{
  "nDwv1vABjE_uB7Je59w": {
    "name": "Lil Nas X",
    "description": "Lil Nas X was born as Montero Lamar Hill in 1999. His stage name combines \"Lil\" (a common naming trope for rappers), \"Nas\" from a Twitter account he ran while a devoted fan of Nicki Minaj and \"X\" as the Roman numeral 10 (the number of years he thought it would take to find fame). Nas has the social media savvy to make his work stand out in a crowded landscape, which helped with his breakthrough \"Old Town Road.\" Nas then created a meaningful, yet still attention-grabbing, first album: Montero (2021). The record contains hits like \"Industry Baby\" and \"Montero (Call Me by Your Name)\"; the personal tune \"Sun Goes Down\" addresses how a young Nas grappled with being gay. After being taught homosexuality was wrong when he was growing up, Nas conveys the message that he would like gay relationships to become so accepted by society that they are rendered unremarkable."
  },
  "x7FKhWAtW_DVXJe7YSM": {
    "name": "Altered State",
    "description": "Altered State (David Sheehan) is a well apprised Dublin based Dj and producer. He is highly considered at the forefront of the Irish Psy trance scene, this being purely based on his ample talents as both an entertainer and a producer.Altered State is the ultimate entrenpreneur and the epitome of potential. His genuine dexterity will shed nothing only stardom upon his journey through the great and almighty dance scene of today & is certainly a Dj not to be missed."
  },
  "Oc899ICemhaCiAveK5g": {
    "name": "Xenoben",
    "description": "Xenoben is the stage name of UK-based Psychedelic Trance producer & DJ Benjamin Gildersleve.Ben’s passion for Psychedelic Trance started in London at the turn of the century when he attended some of the UK’s biggest Psytrance events. He turned from DJing to producing in 2012 and since then has released several tracks on CD and digital format and performed at various festivals.In May 2018, Xenoben released his first EP ‘Morning Daze’ on major label TesseracTstudio which smashed its way to the top of the Beatport Psytrance Releases chart. Later that year, a collaboration EP with Waveform also hit the number 1 position, earning Ben and his project more respect within the trance scene.Inspiration for his project is drawn from other talented UK producers and merged with the Serbian-style techniques of TesseracTstudio artists to produce clever and hypnotic polychrome atmospheres and trippy psychedelic vocal effects over intimidating heavy basslines.The future is bright for Xenoben with many singles, releases, collaborations and event bookings coming in the very near future."
  },
  "IqW0Qi8zzJzK66yidII": {
    "name": "Infected Mushroom",
    "description": "Electronic music, mega-revolutionaries Infected Mushroom are renowned for being the sonic innovators of crafting hypnotic arrangements, complex layered melodies and synthetic rhythms known as “Psy Trance. The duo broke into the scene with the release of their first album in 1999, and unconsciously changed trance music forever.Responsible for the evolution of psychedelic trance, they have gone on to experience the highest level of success in the psy trance scene, crossing over towards the electronic dance community, selling out venues and headlining festivals worldwide."
  },
  "dIzdh0RO8hlrR2gpzaQ": {
    "name": "Mobb Deep",
    "description": "Mobb Deep stood tall as East Coast hardcore rap figureheads on the basis of their epochal album The Infamous. Released in April 1995, The Infamous was released almost exactly a year after Illmatic and about half-a-year after Ready to Die -- the debut masterpieces of Nas and the Notorious B.I.G., respectively, and likewise albums of momentous significance for East Coast hardcore rap. On The Infamous, the duo of Prodigy and Havoc set the tone for future generations of hardcore New York rappers, from crews such as G-Unit and Dipset, to the likes of Ka and Roc Marciano. Subsequent Mobb Deep releases were equally influential, especially Hell on Earth (1996). The following decade, Prodigy and Havoc recorded for G-Unit -- the label of Mobb Deep disciple 50 Cent -- as well as numerous other outlets. The duo's partnership faltered for a time, but they were actively performing into mid-2017, when Prodigy died from complications of an illness that had afflicted him since infancy."
  },
  "IOzNKqb-W9wvyO7SE6k": {
    "name": "Atacama",
    "description": "Since their very first psytrance parties more than ten yearsback in time the Berliners Kevin Hentschel and RafaelGomez never stopped experimenting with electronic sounds.Alongside multiple excursions into various sub-genres, ownlabel activities and many open air- and club events the twofriends concentrate since 2012 on the production of drivingpsychedelic trance music. After some releases in Spain andfurther mindblowing experiences while playing large festivals– such as the Fusion Festival – the two musicians reinventedtheir sound – and themselves – as „Atacama“.Sometimes mysterious, always complex and preferencialdriving Atacama carry off their listeners in spheres betweenbygone experiences and oncoming promises where mythsand reality, rhythm and movement merge into a cosmic unity."
  },
  "eBn0moHkU2hx7GYLruo": {
    "name": "Jakaan",
    "description": "Jakaan (24) is one of the most productive DJ's in the Dutch psytrance-scene. Since the age of 13 he has been spinning psytrance, full on and progressive. You can follow him on his youtube-channel where he uploads a new mix every week, including the latest releases. He is always looking for the latest tracks, when he's playing a live-set he often spins unreleased records from the most talented and well known producers in the psytrance-scene. Nowadays you can frequently hear Jakaan DJ-ing on psychedelik.com Jakaan often perfoms his tricks at squat-parties, but also in larger venues and festivals such as \"Club Lite\", \"Magneet Festival\" (NL) and \"The -S-Xperience\". When he's playing live, Jakaan never plays the same set twice. Jakaan knows and feels what the crowd wants and needs and he won't hesitate to give the people what they came for... A good vibe on the dancefloor!"
  },
  "52D88Af5tK7P-7bSZ1w": {
    "name": "Reborn",
    "description": "Reborn is a project by Faraz Radmehr from Tehran-Iran. Born in 1988 and The journey into Psytrance and Electronic music has begun in India in 2012. After he had attended many Psytrance and Electronic music parties and festivals mainly held in Goa-India for almost 11 years while living there, he decided to make his own music by producing and experimenting various genre of music. The result of years of self-tought production is something very unique and rare in music market which have brought the attention to him so quickly. Presently he creates his own unique style of electronic music which includes touches of Psytrance, Progressive Trance and Full On. Currently his main focus of him is on Psytrance style of electronic music. Stay tuned for upcoming releases."
  },
  "4Y61KOly6fscVi43hYQ": {
    "name": "J Dilla",
    "description": "Born and raised on the east side of Detroit, Dilla -- James Yancey -- was forced by his parents to become involved with music, and he was a record fanatic at a young age, absorbing funk and rap singles and jazz albums, from Slave to Jack McDuff. He learned to play cello, keyboards, trumpet, and violin, but drums got him like nothing else. He tried his hand at producing tracks on a tape deck by using the pause and record buttons, and he also took up MC'ing. In 1988, he formed Slum Village with Pershing High School friends Baatin and T3. It wasn't until 1992, after receiving some valuable guidance from fellow Detroiter Amp Fiddler, that his talent really began to take shape."
  },
  "9oPMOD2sIG2Y1StdrgQ": {
    "name": "Astrix",
    "description": "Astrix has been one of the leading trance producers and DJs in the world for more than 15 years, carrying his musical message of psychedelic emotional uplifting trance to every corner of the world, to the biggest urban clubs and far away beaches, huge festivals and underground events. Devoted to his art and a true perfectionist, Astrix is known for his massive hypnotic explosive sets on the dance-floor and for his precise detailed production in the studio. Both always laced with tons of feel and musicality. His music has been topping the charts and his albums are considered milestones."
  },
  "c7QWGpV0v3HVC4q9W4w": {
    "name": "Transient Disorder",
    "description": "Filipe Trindade a.k.a Transient Disorder was born in Portugal in the 90’s. His interest for music started very early, at the age of 13 he took his first steps playing the guitar. Later he had his first contact with electronic music, and caught the bug, never looking back. In the past he was part of several metal, hardcore and punk bands, and also participated in various electronic music projects, until he formed his solo project Transient Disorder, focusing on the psychedelic. His appearance on the Dacru Records uncharted series didn’t go unnoticed as the label offered him a fixed spot on their roster. As a young producer, his style is a perfect fit for dacru, with beautiful melodic touches and a strong production. Keep an eye out for this up-and-comer with many releases in the pipeline at Dacru Records."
  },
  "3rbvSRgp3pf-x8q974I": {
    "name": "Tropical Bleyage",
    "description": "Tropical Bleyage is a project by Pavle Perovic and Marko Graovic from Belgrade, Serbia. They started making music in 2005 and since then have developed their music to powerful full-on trance gifted with irresistible fusion of melodies. The duo are one of the freshest projects on Dacru Records releasing already 2 EPs on this label. Their productions have also been released on Psy-Core Records, DNA records, Zoo Music, Yellow Sunshine Explosion, Psytropic Records and more."
  },
  "xchjR7U9ug2bI7wZCII": {
    "name": "Mad Tribe",
    "description": "MAD TRIBE is a collaboration between SPACE TRIBE & MAD MAXX (Olli Wisdom & Max Peterson). Mad Tribe make, Inspiring, Intense Full Power music with incredible production technique. They are both well established artists on the Psytrance scene for many years. They met in San Francisco at  the infamous CCC parties & became good friends. They started making music together in 2005 clicking immediately with a shared vision for a full power psychedelic sound with twisted sense of humour. MAD TRIBE received fantastic response to their first album ”SPACED OUT” on TIP records 2015, Bringing a juicy psychedelic experience, guaranteed to spark all 6 senses. In 2016 Mad Tribe released Tuned in Perfectly, Alien Hoax & The LSD party EPs & a stunning vinyl picture disc."
  },
  "9_85SxzXAA9uISNplYs": {
    "name": "Dillon Cooper",
    "description": "Born and Raised in Crown Heights Brooklyn, NY, in 1992, Dillon Cooper is doing exactly what he’s set out to do \" Conquer his dreams.\" He became a self-taught guitarist at age 8, and a college freshman by age 17 at one of the world's most sought after music schools, Berklee College of Music (the alma mater of John Mayer and Quincy Jones). Dillon has achieved a number of accolades to date, which he refers to as \"fun times …\" but these are real achievements that attest to who he is: Guitarist, Rapper, Freestyle Roller (Aggressive Inline Skating), and aspiring Actor."
  },
  "A2y2DStLt11yWw1pwGA": {
    "name": "SoulChef",
    "description": "SoulChef is a producer / composer / musician from Auckland, New Zealand. His music is a smooth and versatile blend of jazz, soul and hip hop."
  },
  "49NwaGlllFjrGyA0zHk": {
    "name": "Ice Cube",
    "description": "O’Shea Jackson (born June 15, 1969 in South Central Los Angeles, California) is an American rapper, actor, producer and film director known for being a member of the controversial rap group N.W.A. In recent years, Ice Cube’s acting career has overshadowed his career in music. He released his solo debut album, AmeriKKKa’s Most Wanted in 1990 to critical and commercial success, although upon its release he was accused of racism and misogyny. He has since released 1991’s Death Certificate, 1992’s The Predator, 1993’s Lethal Injection, 1998’s War & Peace Vol 1 (The War Disc), 2000’s War & Peace Vol 2 (The Peace Disc), 2006’s Laugh Now, Cry Later and 2008’s Raw Footage."
  },
  "geUI0EQNJTajQNKV8f8": {
    "name": "Dr Dre",
    "description": "A music fan from the start, Dr. Dre started working as a DJ in his teens. His first major success came with the rap group N.W.A. and he later co-founded Death Row Records in 1991. In 1992, his first solo album, The Chronic, became a huge hit. Dre started up Aftermath Entertainment in 1996 and signed Eminem and 50 Cent to his label. He eventually co-founded the company Beats Electronics with Jimmy Iovine, going on to make millions from its 2014 sale to Apple. "
  },
  "fisjzl_l0xxq0vudhmc": {
    "name": "MC Ren",
    "description": "Lorenzo Jerald Patterson (born June 16, 1969), better known by his stage name MC Ren, is an American rapper, songwriter and record producer from Compton, California. He is the founder and owner of the record label Villain Entertainment. MC Ren began his career as a solo artist signed to Eazy-E's Ruthless Records in early 1987, while still attending high school. By the end of 1987, after having written nearly half of Eazy-Duz-It, he became a member of N.W.A. After the group disbanded in 1991, he stayed with Ruthless, releasing 3 solo albums including the controversial Shock of the Hour before leaving the label in 1998. In 2016, he was inducted into the Rock and Roll Hall of Fame as a member of N.W.A."
  },
  "sqd0B7wvY1AaA9CQNhI": {
    "name": "2Pac",
    "description": "Tupac Amaru Shakur (/ˈtuːpɑːk ʃəˈkʊər/ TOO-pahk shə-KOOR; born Lesane Parish Crooks, June 16, 1971 – September 13, 1996), better known by his stage name 2Pac and later by his alias Makaveli, was an American rapper and actor. Considered one of the most influential rappers of all time, Shakur is among the best-selling music artists, having sold more than 75 million records worldwide. Much of Shakur's music has been noted for addressing contemporary social issues that plagued inner cities, and he is considered a symbol of activism against inequality. Shakur was born in New York City to parents who were both political activists and Black Panther Party members. Raised by his mother, he relocated to Baltimore in 1984 and to the San Francisco Bay Area in 1988. With the release of his debut album 2Pacalypse Now in 1991, he became a central figure in West Coast hip hop for his conscious rap lyrics. Shakur achieved further critical and commercial success with his follow-up albums Strictly 4 My N.I.G.G.A.Z... (1993) and Me Against the World (1995). His Diamond certified album All Eyez on Me (1996), the first double-length album in hip-hop history, abandoned his introspective lyrics for volatile gangsta rap. In addition to his music career, Shakur also found considerable success as an actor, with his starring roles in Juice (1992), Poetic Justice (1993), Above the Rim (1994), Bullet (1996), Gridlock'd (1997), and Gang Related (1997)."
  },
  "YFDVzKsG5g9UlM6t0ZA": {
    "name": "Mr. Hyde",
    "description": "Mr. Hyde, the New Yorker rapper, is well-known for his ultimately violent, attacking, raw lyrics and extremely energetic flow. His rhymes are released in the guise of a mad man scientist. Rapping Psycho+Logical, Mr Hyde is from the same NYC school as Necro in themeology and style of beats and melodies."
  },
  "x2QfpGQR1QnDW-omGL4": {
    "name": "Ill Bill",
    "description": "William Braunstein (born July 14, 1972), known by his stage name Ill Bill, is an American rapper and record producer from Brooklyn, New York. Having gained fame in the underground hip hop group Non Phixion, Ill Bill is known for his diverse lyrics and as the producer, founder and CEO of Uncle Howie Records. His brother Ron is rapper and producer Necro."
  },
  "d6g_YpkwpXIEk1fsLzE": {
    "name": "Q-Unique",
    "description": "Anthony Quiles, better known by his stage name Q-Unique is an American rapper, record producer and a member of rap group Arsonists and street metal band StillWell. He also contributed vocals for dance/hip-hop group C+C Music Factory."
  },
  "e5m1L0CXmO9IKoQygyA": {
    "name": "DJ Eclipse",
    "description": "Born in Providence, RI, in the early '70s, by the time Eclipse moved to Columbia, SC, in 1985, he was already fast becoming a requested and respected DJ. In 1992 he left South Carolina for New York to produce MC Serch's (who he had met in Columbia) sophomore album, which -- due to problems with label Def Jam -- was never released. In 1994, working at Wild Pitch Records in retail promotion, Eclipse met Sabac, who, along with Ill Bill and Goretex, formed Non Phixion in 1995. Eventually Eclipse moved over to work at Fat Beats Records, also DJing for acts like Natural Elements, Beatnuts, and 3rd Bass. In 2002 Eclipse officially left Fat Beats to co-run Uncle Howie Records with bandmate Ill Bill, who then finally issued Non Phixion's full-length debut, The Future Is Now, the same year."
  },
  "wmJIKE860MlrA3FSrtY": {
    "name": "Artifacts",
    "description": "The Artifacts is a hip hop group consisting of El Da Sensei, Tame One and DJ Kaos. They hail from Newark, New Jersey and made underground music that paid homage to the four elements of hip hop. The Artifacts' most popular single \"Wrong Side of Da Tracks\" paid special homage to graffiti, as they were graffiti writers themselves. Other of artifacts' popular hits include \"Easter\", \"C'Mon wit da Git Down\" and \"The Ultimate (You Know The Time)\".["
  },
  "kXsdVDWY5CacDlU3ERc": {
    "name": "A-Tech",
    "description": "A-Tech is the solo psychedelic trance project created by Tiago Guerra, native of the city of Porto. Since always a passionate about various types of music, in 2001 he had his  rst contact with electronic music, and soon after 2 years began to dedicate himself to the slope of Djing, exploring sounds like house music, techno or trance.Almost 10 years later, driven by a great desire to create his own sonorities, Tiago Guerra started to create his own music, psychedelic music.At the beginning of 2016 he presented his A-Tech project and soon 3 months later he was invited to release one of his songs in the compilation Uncharted Vol.3, with the Dacru Records label. Later on, A-tech has released for other major labels such as Digital Om, Maharetta Records, or Psynoptics Records.The A-Tech music and project keeps growing everyday, and now it's beeing played all over the world. The A-Tech project comes from a careful and harmonious fusion between psychedelic sonorities and the energy that only trance music can transmit."
  },
  "acxbN1V4IyfQEEQjw7A": {
    "name": "Ours Samplus",
    "description": "The Ours Samplus project was born in 2011. Composed of 2 Beatmakers from the Tchernolille collective, the duo immerses you in a warm sound universe where the crackling of old samples is in the spotlight. The two artists from Lille, followers of \"Do it yourself\" draw their influences from jazz, hip-hop, swing and electronics."
  },
  "LvdgQey4vTxAYUHkOfo": {
    "name": "Gramatik",
    "description": "Denis Jašarević was born in Portorož, SR Slovenia, SFR Yugoslavia on 19 October 1984. Jašarević’s interest in music began at the age of three, when his mother would catch him listening to American funk, jazz, soul and blues from his older sister’s cassette tapes. As he got older, he was introduced to hip hop culture and listened to artists such as DJ Premier, Guru, RZA and Dr. Dre."
  },
  "-AyG4gERkNSrlvY21ds": {
    "name": "Bent",
    "description": "Bent are an electronica act from Nottingham in England, consisting of Neil \"Nail\" Tolliday and Simon Mills. They released their debut album Programmed to Love in 2000. The duo were initially noted for their ability to create their own mischievous style of recordings by sampling their private record collections (which they have themselves referred to as \"dodgy\"). On the 2003 single \"Magic Love\" they sampled a Toni Tennille performance. Nana Mouskouri is one of the artists they have sampled the most so far. Another notably sampled artist is the Canadian singer Anne Murray, whose song \"Just Bidin' My Time\" is heavily used for the lyrics of \"Leavin' Me\"."
  },
  "lA0ajIespDNcp7wZMQ4": {
    "name": "Shamanizm Parallelii",
    "description": "Shamanizm Parallelii is Russian psychedelic chillout duo founded in 2010 by Pavel Yashan (a passionate music lover and a vinyl collector who has been influenced by late ’60s rock music and artists from that era) and Arkadiy Tronets (Goa trance and nitzhogoa producer who has been known by his works under JBC Arkadii project). Pavel started writting music at beginning of the new millennium and finally, after he met Arkadiy in 2010, they started to produce tracks under Shamanizam Parallelii name, mostly experimenting with various styles of electronica, but soon after they established their style and sound, which can be described as a blend between space/psychedelic rock and relaxed chillout music, strongly influenced by dub."
  },
  "fZWx3rZq1o9zyozTpSY": {
    "name": "Alienatic",
    "description": "Alienatic is a full on psytrance project by Jake van Aarst and Dennis van der Stel in recent years, the dutch duo has consistently been blazing the trail of fluid psychedelic journeys we got our first taste from the dutch’s exhilarating talents when they debuted on sacred technology back in November 2018 with ‘first contact’. Their unique alchemy of psychedelic and trance made them become one of the breakout stars of 2019 and ensured they will stay firmly on the radar for a long time. Alienatic is releasing music on established labels such as digital om, sacred technology, and nano records. In 2020 Alieniatic made two massive remixes for Ajja and Tristan."
  },
  "NkEbICIGagtbjGqbtrk": {
    "name": "Bellatrix",
    "description": "Bellatrix Is A Deep Psytrance Project By Ali Azad From Iran. Bellatrix After Having A Lot Of Success Solo Releases, Many Powerful Remixes And Numerous Collaboration In The Psytrance Scene, He Is An Official Artist At Iono Music Based On Germany Which Is One Of The Best & Biggest Psytrance Record Label In The Scene And Now He Is One Of The Leading Iranian Psytrance Producer. Also He Has Been Supported By The Big Names Such As Ace Ventura And Liquid Soul. Having A Good Experiment With Sound Design And With A Search For The Right And Unique Music Expression, He Is Now Ready To Unlish His Magic To The Universe. Bellatrix Project Has Punchy Bass Lines, Pure Psychedelic Sounds, Deep Atmosphere, Hypnotic Melodies And Very Emotional And Groovy Workflow With A Futuristic Buildup. Stay Tuned For More Major Releases."
  },
  "uRFTeyiieGNlSQiZ3k8": {
    "name": "Sybarite",
    "description": "Sybarite is the solo project of musician Xian Hawkins, who played with the Silver Apples for a number of years in the 1990s. Sybarite produces abstract midtempo electronica, but also contains elements of jazz and classical music. He has released albums on the 4AD label among others. As of 2015, Sybarite is now featured on the Temporary Residence Ltd. label. The Sybarite track \"Runaway\" was featured on the Grey's Anatomy TV series episode \"Wishin' and Hopin'\"."
  },
  "uRFTeyiieGNlSQiZ3k8": {
    "name": "Ashtar Command",
    "description": "Ashtar Command is the name of an indie rock band composed of Chris Holmes (not to be confused with the former guitar player for the metal band W.A.S.P.) and Brian Liesegang. They have released one album: \"Love Songs In Advance of the Landing\", one EP: \"Holding Out For Love\", and have had songs featured in a number of feature films, television series, television commercials, and video games such as one of the first Microsoft Zune commercials, on the FIFA 13 soundtrack list, two Nissan Altima commercials, on The Avengers (1998) Soundtrack, on Spread, on Fragments, on The O.C. television series, and on Rockstar Games' Red Dead Redemption Original Soundtrack and in the video game end credits sequence."
  },
  "L5XTppYU9sT8gmcCrbE": {
    "name": "Razzle Dazzle",
    "description": "No description found.."
  },
  "hMyNhL1YqlMHp9lnhnU": {
    "name": "Pixel",
    "description": "Project Name: Pixel. Full Name: Eli Biton Tal. Project debut: 2001. Hobbies: playing pool and building kites. Spirit Animal: Jellysh. Favourite Country: Countryside. Favourite Season of the year: season 2. Beer or Wine: Both are fine. Most Memorable Preformance: I don’t kiss and tell.. number between 1- 10: 110. favourite word: loop. goals: to wake up everyday in a different hour. favourite movie: Clueless. favourite musician: Arik Einstein."
  },
  "R0otLc0YxtqLg2uAAOc": {
    "name": "Wrecked Machines",
    "description": "Top 5 in the world and the biggest phenomenon in brazilian trance of all times. Broke barriers to become one of the main revelations in the scene for the last few years and above that to become the first brazilian to gain a place in the international market. Hits like \"Trancespotting\" and \"Round n' Round\" are both well known around the world, and the recent release of his second album for Spun Records and Solstice Music are markers for his maturity and assuring his place in the top of the trance in the world.  Gabe started in the emusic scene in 2000, when he worked at Galeria Ouro Fino, at the time, the temple of emusic in Brazil, where he got in contact with the famous djs of that time. At this point, Gabe started producing in his Playstation and in a few months he was releasing his first track for Magma Records (Italy). Then he was invited to join Etnicanet and started to create his live act, named Wrecked Machines, wich after would be known in Japan, Germany, South Afrika, Israel, Portugal and Mexico.  In April 2003, he produced \"Worried World 12\"\", his first vinyl album, then in june of the same year, he released \"blink\", his first full album, both for Etnicanet (Ibiza) and Solstice Music (Japan). This international releases, caused great impact and took him to large events around the globe. He became very popular in Japan after his presentation at the \"Countdown On New Year's Eve 2003\" and \"Archaic Revival\", in 2004. At this point he was already been known as one of the greatest trance upcoming revelations in the world.  Thanks to his productions, at the end of 2003, he signed up with Spun Records. Now Wrecked Machines was been elected by the media as the best Live Act and Best trance producer in Brazil. During this time, Gabe made partnerships with the biggest names in world trance, susch as: GMS, Domestic, Pixel, Psysex, Simon Posford, Panic, Antidote, Shanti, Dimitri Nakov, Étnica, Atomic Pulse, Intelabeam, Joti Sidhu an dj Mack. And now he joined GMS in a new project named Growling Machines, which is getting recognition in the international scene.  In February 2005, Gabe release his second album, \"Second Thought\" for Spun Records (Spain – Ibiza), Solstice Music (Japan) and Carambola Records (Brazil). Assurring one more time his value in the music production.  He just finished \"Wreck Chord\", his first compilation (double album), relesased in 2006 for Spun Records (Spain). An exclusive album containing great names such as: Wrecked Machines, GMS, Pixel, Domestic, Growling Machines, Beckers, X-Noize, Nick and Perplex. The other disc has Spun Records release mixed by Gabe."
  },
  "k4hrim17l1UFrVZ9tew": {
    "name": "FNX",
    "description": "NX also known as Kaique Belli, began to get interested in Electronic Music in 2012. \"More than one Djs\". At the age of 17, he studied Music Production at Anhembi Morumbi College. Currently, at the age of 21, he is part of the E-TRIP crew and also representing Profound Records as a DJ.  With his project \"Fenix\" comes seeking this space with the striking. Their inuences range from electronic music to rock / reggae, transmitting the spirit and the positive energy of Brazil, with psychedelic melodies, dancing basslines and always mixing strands within their ensemble. With an explosive stage presence, Kaique becomes outstanding and puts everyone to dance on any dance floor!"
  },
  "OgAGTKEVHGlEbR5um2I": {
    "name": "Bitkit",
    "description": "Bitkit hails from Belgium, with its rich electronic music history. As a youngster he got classical schooling in different instruments. Psytrance was discovered in 2000 and it was 'love at first sound'! His music is described as roaring powerful full on trance, a combination of pumping original basslines and a deadly accurate kick. Stuffed with crispy fresh psychedelic anthems, you get a mindblowing soundscape which will leave any dancefloor begging for more! Throughout his long career he has received support from all corners of the globe. He has performed all over Europe, even reaching as far as Asia. His lasting urge to optimize his studio expertise makes this creative mind constantly evolve to another level of production. In 2013 he joined the Belgian powerhouse Dacru Records and got invited to play at the Tree of Life festival in Turkey. Another definite highlight was his second set at Tomorrowland, considered to be one of the best electronic music festivals in the world), after making his first appearance there in 2010."
  },
  "ihZJDNeXoqkVhOuzqi0": {
    "name": "Lexxus",
    "description": "Lexxus is an independent Fullon - psychedelic trance artist, which started producing music in 2015 and is based near the Mountains in the beautiful heart of Bavaria.  His music is filled with heartwarming uplifting Melodies, deep psychedelic atmospheres and unmistakably jumping basslines."
  },
  "PVOuQG_qwlJC2BdxAVw": {
    "name": "Fluxsense",
    "description": "Fluxsense was born in 2016 as an altern Project of Abstrackt Dimension (Progressive Psytrance), mainly focused in the Psychill/Psybient/Chillgressive’s genre and style, with the debut album called “CODE OF LIFE” released independently in Bandcamp,at the same time Fluxsense met Jedidiah and they decide create the dual “D.M.T.” (Dimensional Mind Transmission [Di.Mi.Tn.]) releasing an Ep “ORACULUM” in Ovnimoon Records (Chile). In 2017 the 2nd Fluxsense’s album “IONOSPHERE” was launched in Uxmal Records (México), making presence in Beatport, Spotify, iTunes, & another digital stores. After the good response, some artists wanted to collaborate, among them I.M.D, Tranonica, Stardust, among others. Same year the track “THROUGH YOUR EYES” was released in the V.A. Gaia Temple compiled by Jedidiah in Ovnimoon Records (Chile). In 2018 “ARCTIC SUNSET” was released for the V.A. Lunar Nights Chapter One Compiled by Axel Astrid & Red Sun Rising in Reson8 Music (Italy/Chile). At the early 2019 another track was released: “REANIMATION” for the V.A. Fairy Tales vol. 4 in OmMantra Records (Hungary). Same year Fluxsense joins the first mexican label exclusive in the Chillout genre “ASTRALVISION RECORDS”. Fluxsense is the Biotechnological concept, with the purpose of inspiring with his stories and melodies, creating a dream-like state, healing emotions and canalizing vibrations with atmospheres into a peaceful environment, stimulating the flux sense."
  },
  "b0YDjRnTmCNUQ24XYG4": {
    "name": "Matt Jah",
    "description": "Matt Jah is a songwriter, producer and composer that love to create many kind of music: Reggae, dub, psychill, downtempo, world music."
  },
  "nAU2lLX9x-kejD_c3gE": {
    "name": "Mobitex",
    "description": "Mobitex is an electronic music band created by Eyal markovich."
  },
  "6jBsYZXobSrqAOKSM6k": {
    "name": "Deltron 3030",
    "description": "Deltron 3030 is an alternative hip hop trio composed of producer Dan the Automator (as the Cantankerous Captain Aptos), rapper Del the Funky Homosapien (as Deltron Zero/Deltron Osiris), and DJ Kid Koala (as Skiznod the Boy Wonder). They also collaborate with a variety of other musicians under many futuristic pseudonyms."
  },
  "RqqJQPr_iFnTXbDdtOs": {
    "name": "NECRO",
    "description": "Ron Raphael Braunstein (born June 7, 1976), better known by his stage-name Necro, is an American rapper from Brooklyn. He is the owner of Psycho+Logical-Records founded November 1999. He is the younger brother of rapper Ill Bill. Necro was born in Brooklyn, New York and grew up in the Glenwood Houses, where he lived for eight years from about 6 years old to age 14, when he moved to Canarsie. Born into a Jewish family, he is the son of Israeli expatriates, with ancestry from Israel and Romania. Necro's father was a Romanian-born Israeli soldier and his mother an Orthodox baal teshuva. He began his musical career at 11, playing in a death metal band named Injustice. He made a transition from heavy metal to hip hop. In 1988, he started rapping after being influenced by his older brother, rapper Ill Bill. Necro derived his stage-name from the Slayer song \"Necrophiliac\". Before that he called himself \"Mad Mooney\", which was a character from a Clive Barker book. He made his first demo in about 1990 and won a demo battle contest on the Stretch Armstrong and Bobbito show on WKCR-FM. In about 1993, Necro started rapping full-time and made a demo called \"Do The Charles Manson\". In 1995, he proceeded to rap on the Wildman Steve and DJ Riz show WBAU 90.3FM."
  },
  "DouVWkmb03NoumQeVZg": {
    "name": "Lauge",
    "description": "Chillout / Downtempo / Ambient project from Copenhagen, Denmark. Created by Henrik Rolsted Laugesen."
  },
  "XWAtNgKpjn17aZ0BlYs": {
    "name": "PSYBORT",
    "description": "Meet Spyros Mauromatis aka Psybort. Born in Athens in 1989, he showed his love for electronic music from a very young age. Soon he started learning keyboards and composing his own tracks. After experimenting with several types of electronic music he now creates psybient, psychill and chillgressive / progressive chill because he was won over by the combination of the melodies of the atmospheric and psychedelic sounds. He has been featured in compilations of labels like: Landmark records, Sunna Records, and AstralVision Records, and in 2021 he released his first album \"Illusion Of Time\" on OM Mantra records."
  },
  "9Sk8wBxXZ7uQd_x7d1I": {
    "name": "Suduaya",
    "description": "Suduaya is a French guitarist, composer and DJ who produces Goa trance music, progressive psytrance and ambient. His real name is Louis-David Roquefere. He gained worldwide fame mainly by putting his albums online on Soundcloud and YouTube. In 2011 he produced the first soundtrack for the Klopfgeister's compilation entitled Stand up against gravity. His first album Dreaming Sun (Altar Records) was released in September 2011."
  },
  "ez1HwRez1E7xJs4xWPY": {
    "name": "Travis Scott",
    "description": "Jacques Bermon Webster II (born April 30, 1991), better known by his stage name Travis Scott (formerly stylized as Travi$ Scott), is an American rapper, singer, and record producer. His stage name is the namesake of a favorite uncle combined with the first name of one of his inspirations, Kid Cudi (whose real name is Scott Mescudi). In 2012, Scott signed his first major-label contract with Epic Records. In November of the same year, Scott signed a publishing deal with Kanye West's GOOD Music, as part of its production wing Very GOOD Beats. In April 2013, Scott signed a recording contract with T.I.'s Grand Hustle imprint. Scott's first full-length project, the mixtape Owl Pharaoh, was self-released in 2013. It was followed with a second mixtape, Days Before Rodeo, in August 2014. His debut studio album, Rodeo (2015), was led by the hit single \"Antidote\". His second album, Birds in the Trap Sing McKnight (2016), became his first number one album on the Billboard 200. The following year, Scott released a collaborative album with Quavo titled Huncho Jack, Jack Huncho under the group name Huncho Jack. In 2018, his third studio album, Astroworld, was released to critical acclaim and produced his first Billboard Hot 100 number one single, \"Sicko Mode\" (featuring Drake). In late 2019, Scott's record label Cactus Jack Records released the compilation album JackBoys which became the first number one album on the Billboard 200 of the 2020s. After the release of his single \"Franchise\" (featuring Young Thug and M.I.A.) in September 2020, Scott became the first artist on the Hot 100 to have three songs debut at number one in less than a year. He has been nominated for eight Grammy Awards and won a Billboard Music Award and a Latin Grammy Award. Scott has gained notoriety for controversies and legal issues regarding safety at his concerts. On November 5, 2021, a mass-casualty crowd crush occurred during Scott's performance at the Astroworld Festival in his hometown of Houston, Texas, killing ten people and injuring hundreds of others."
  },
  "ZusUvDH0mbajmPS-AoA": {
    "name": "Pop Smoke",
    "description": "Bashar Barakah Jackson (July 20, 1999 – February 19, 2020), known professionally as Pop Smoke, was an American rapper closely associated with Brooklyn drill. Born and raised in Canarsie, Brooklyn, he rose to fame with the release of his breakout singles \"Welcome to the Party\" and \"Dior\" in 2019. He released his debut mixtape Meet the Woo in July 2019. His second mixtape, Meet the Woo 2, was released on February 7, 2020, and debuted at number seven on the Billboard 200, becoming the rapper's first top-10 project in the United States. Less than two weeks after the release of the mixtape, Pop Smoke was murdered during a home invasion in Los Angeles. His posthumous debut studio album, Shoot for the Stars, Aim for the Moon, debuted at number one on the Billboard 200 and all 19 tracks from the album charted on the Billboard Hot 100."
  },
  "4RMVtlZPkx3A-aQd-6M": {
    "name": "Kendrick Lamar",
    "description": "Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper, songwriter and record producer. Since his mainstream debut in 2012 with Good Kid, M.A.A.D City, Lamar has been regarded as one of the most influential rappers of his generation. Aside from his solo career, he is also known as a member of the hip hop supergroup Black Hippy alongside his Top Dawg Entertainment (TDE) label-mates Ab-Soul, Jay Rock, and Schoolboy Q.  Raised in Compton, California, Lamar embarked on his musical career as a teenager under the stage name K.Dot, releasing a mixtape that garnered local attention and led to his signing with indie record label Top Dawg Entertainment. He began to gain recognition in 2010 after his first retail release, Overly Dedicated. The following year, he independently released his first studio album, Section.80, which included his first single \"HiiiPoWeR\". By that time, he had amassed a large online following and collaborated with several prominent hip hop artists.  Lamar's major-label debut album, Good Kid, M.A.A.D City, was released in 2012 to critical acclaim. It would go on to be certified triple platinum by the Recording Industry Association of America (RIAA). His third album To Pimp a Butterfly (2015) incorporated elements of funk, soul, jazz, and spoken word. It became his first number one album on the Billboard 200, and was the most acclaimed album of the 2010s, according to statistics from Metacritic. It was followed by Untitled Unmastered (2016), a collection of unreleased demos that originated during the recording sessions for To Pimp a Butterfly. He released his fourth album, Damn (2017) to further acclaim; its lead single \"Humble\" topped the US Billboard Hot 100, while the album became the first non-classical and non-jazz album to be awarded the Pulitzer Prize for Music. In 2018, he wrote and produced 14 songs for the soundtrack to the superhero film Black Panther, which also received critical acclaim.  Lamar has received many accolades over the course of his career, including 13 Grammy Awards, two American Music Awards, six Billboard Music Awards, a Brit Award, 11 MTV Video Music Awards, a Pulitzer Prize, and an Academy Award nomination. In 2012, MTV named him the Hottest MC in the Game on their annual list. Time named him one of the 100 most influential people in the world in 2016. In 2015, he received the California State Senate's Generational Icon Award. Three of his studio albums have been listed in Rolling Stone's 500 Greatest Albums of All Time (2020)."
  },
  "KrEHGeKWsvk02bfLp8k": {
    "name": "Hucci",
    "description": "Hucci is a highly acknowledged DJ and considered among the best in United Kingdom. Hucci is performing within the field of commercial dance music and is ranked 919 on the official DJ rankings list. UK Trap prodigy HUCCI has been generating serious heat since his 2013 debut ‘Novacane’ EP, garnering support from trap demigods like Flosstradamus and reaching across the pond to the ears of Diplo’s Mad Decent. In the Summer of 2014 ‘HITTA’ broke hard on YouTube and his first smash racked up fans globally at phenomenal speed, setting up 2015 as his breakthrough year.  2015 has seen him play headline shows in Asia, Australia, Europe, USA and launch Veyron Arche, which has featured releases from HUCCI, Ozzie, Fwdslxsh & The Ninetys so far.  Designed and centred around the mysterious UK producer, his aim for the label is to bring the next generation of new talent with him."
  },
  "sn4reTvxYeymTgCSOp4": {
    "name": "DJ Krush",
    "description": "Hideaki Ishi (石 英明, Ishi Hideaki, born July 29, 1962), better known by his stage name DJ Krush, is a record producer and DJ. He is known for his atmospheric instrumental production which incorporates sound elements from nature and extensive use of jazz and soul samples. Ishi was born in Tokyo in 1962. He dropped out of school at an early age and joined a local gang and, a few years later, the yakuza. Early in his career as a yakuza underling, Ishi discovered a severed finger wrapped in paper on his desk. Later, after discovering that it had belonged to a friend, he decided to leave the yakuza and cut ties with the criminal underworld. Ishi was inspired to start DJing after seeing the film Wild Style in 1983. \"When I discovered the film Wild Style in 1983 I found what I really wanted to do, to express myself,\" he said in a 2015 interview. \"Breaking, grafitti, rap, DJ… I always liked music so I chose DJ. My body wasn’t built for breaking, DJing was the thing for me.\""
  },
  "9hlx3aYx1P4zz8lOBMI": {
    "name": "DJ Shadow",
    "description": "DJ Shadow is a pivotal figure in the art of sampling. The Bay Area native's early solo work for the U.K. independent Mo' Wax label culminated in Endtroducing..... (1996), a hip-hop masterwork that incorporated obscure recordings spanning jazz, soul, funk, prog, psychedelia, and other forms, to filmic effect. Since co-piloting UNKLE's Psyence Fiction (1998) with Mo' Wax founder James Lavelle and moving a little farther out with his proper follow-up, The Private Press (2002), Shadow has confounded expectations with each successive step. Across The Outsider (2006), The Less You Know, The Better (2011), and The Mountain Will Fall (2016), the producer naturally distanced himself from using only recordings liberated from cramped record stores hazardous to his breathing. Among other unpredictable moves, he worked with rappers, singers, and fellow musicians ranging from E-40 to Tom Vek to Nils Frahm, embraced the local hyphy movement, and integrated gnashing metal and limpid folk. His scope widened even more with Our Pathetic Age (2019), a double album with separate instrumental and vocal sections. Josh Davis, the man known as DJ Shadow, grew up in the California towns of Hayward and Davis. A rare hip-hop fan in early-'80s suburbia, Davis gravitated toward the turntable/mixer setup of the hip-hop DJ over the guitars, bass, and drums of his peers. He worked his way through hip-hop's early years into the heyday of crews like Eric B. & Rakim, Ultramagnetic MC's, and Public Enemy, groups who prominently featured DJs in their ranks. Further inspired by the production advancements of Steinski and Mantronix, Davis started fiddling around with four-track beatmaking while he was in high school. While attending the University of California, Davis, he DJed at the college radio station and established the Solesides crew and label (with the likes of Blackalicious and Lyrics Born)."
  },
  "TSnkM20ArzN-mU-xBUU": {
    "name": "Aion",
    "description": "Ozmar Romero aka AION, born in Guadalajara, Mexico. He got his taste for Psytrance at the age of 13. Two years later he started to attend festivals, falling completely in love with the trance culture. At 16 years of age he felt the urge to create his own music."
  },
  "NdbFrMw3FHP1qfWlK0I": {
    "name": "Atma",
    "description": "Andrei Oliver Braşovean aka ATMA (born 20 August 1979 in Sibiu) is a Romanian composer, performer and electronic music producer. Andrei Oliver Brasovean is one of the pioneers of electronic music in Eastern Europe. Born in Sibiu (Romania) and now living in Germany, he started to produce electronic music in 1991. Few years later he focused his productions mostly on trance, techno, downtempo and epic music. Known around the globe for his unique style, and with more than 25 years of electronic music production and hundreds of live performances, ATMA made his entrance between the most established names in the electronic music scene. With his long musical background and the experience of working different musical styles he developed a totally unique style of electronic dance music. Deep melodies, perfect harmonies, psychedelic sounds and pumping basslines, it's his \"new definition\" of the trance dance music."
  },
  "6lBSEh4A5h6LfHRlIDo": {
    "name": "Chronosphere",
    "description": "No description found.."
  },
  "qlJgMiCYx2eSlzMKygs": {
    "name": "Cloud6",
    "description": "No description found.."
  },
  "u1jvkjR4i0lhT7PyClU": {
    "name": "Disconnect",
    "description": "Originally from Los Angeles and newly residing in Las Vegas comes Disconnect, a metal head drummer turned bass music producer. He started off playing with local metal bands and wanting to pursue a career in cinematic sound design until he was introduced to dubstep which combined elements from both of his passions into one. He attended Matrix Sessions Music Production school and mentored under Brian Matrix to further progress his skills. His first major release was a collaboration with Yakz that came on Black Ops XLII which was released by Never Say Die Black Label on his birthday May 10th 2019. He has since then started to play shows around the USA and has gained support from the likes of Zomboy, Yakz, OG Nixin and more. Now armed with an arsenal of unreleased tunes ranging several styles of bass music, 2020 is going to see a lot of music from Disconnect."
  },
  "Nb2HxbbAenZeodY1SV8": {
    "name": "Second Life",
    "description": "No description found.."
  },
  "6yzRC-A5rBQM0ANXe5M": {
    "name": "Hypnoise",
    "description": "Signed to Maharetta Records in 2010, Hypnoise started as a duo and nowadays is run solo by Juan Fontoira. First release L.S.D. (Logical Structures Database) was a total success, reaching tops in charts and played all around turning Hypnoise into a reference in the scene. After a few tracks on different labels they released their 2nd Ep Organic Machinery on their brand new label Maharetta Records, follow by their Remixed Ep Retrospective with the collaboration from well-knowns Sonic Species, Ital and Tron, and again it was a total blast on the dance-floors and charts, reaching the Top 5 on worldwide releases for a few weeks. His Debut Album Dimensional Shifting, released in 2014 by Antu Records, was a total success hitting Top 1 on various international charts around the globe, Since then, he has being riding the wave traveling and rocking at the most prestigious festivals and parties around the globe, Including Boom Festival (Portugal), Freqs of Nature (Germany), Shankra (Swiss), The Experience (Thailand), Sunburn (India), Ritual (Mexico), Rezonance (South Africa), Origin (South Africa) and the list goes on... In 2018 he release his second studio album Dance Among the Spirits with well known Sacred Technology Records. In the meantime had been releasing many tracks in different labels as Nano Records, Free Spirit, 24/7 recs, Antu Records,.... and worked in different collaborations with top notch artist."
  },
  "dTubcckp_Q835wnhfoM": {
    "name": "Inner Sphere",
    "description": "Inner Sphere is the unique deep and atmospheric psytrance project of Hamid Panahi from Iran, After his successful ep's and singles on Techsafari Records, Iboga Records, Digital Om Productions, Sourcecode Transmissions, Iono Music and being supported by the well known huge names like Ace Ventura, Liquid Soul, Zen Mechanics, Protoculture and other artists hamid is now focusing on pushing more the iranian psytrance scene to the higher places as a frontliner iranian psytrance producer."
  },
  "vdh2UrDNvuacGoW3LiA": {
    "name": "Inner State",
    "description": "Originating from Thessaloniki / Greece, Marios Karakasidis developed a strong passion for music at a very early age.He first came in contact with the psy-trance genre during his studies in the UK in the late 90s. In 2004 while deepening his knowledge on music production he started his dj career and also set out to ignite his own music productions under the name Inner State. His unique approach to music production soon gave him his first releases in 2007 and ever since,he has published numerous Eps and 2 studio albums,“Terraforma” in 2011 and “Modus Operandi” in 2015 in labels such as (Iono/Spintwist /Yellow Sunshine and more). His sound is all about connecting with the listeners through hi-energy releases, lush atmospheric melodies and fat low end that makes the floor shake! He recently joined powers with TechSafari records where the musical journey continues. Find out more and let the music tell you the rest of this story..."
  },
  "BHGNv2cx48tTlbi_HWU": {
    "name": "Genesia",
    "description": "Genesia comes from 'Genesis', which is scientifically applied to an origin of something. The meaning of this concept will be particularly used though. When everything that human being currently can hear and see did not exist yet, when there was nothing, even the rst particle, something happened. Eriq Dyna [Disorder] & Antonio Resendiz [Ohm] have discovered how to put them into a powerful and addictive formula where the main characteristics are dynamic bases, cinematic atmospheres and a unique evolution of rythms among morning sounds and highly contagious groovy frequencies. "
  },
  "VMM0h0Eklir4oV0EBfw": {
    "name": "Inside Mind",
    "description": "The Inside Mind project is the pure manifestation of mind and soul in compositions. Through sentimental harmonies and melodies, grooves and well elaborated textures, united in a great purpose to provide a unique moment of euphoria and introspection... "
  },
  "ZZydyYYdDv_BKtBUpxU": {
    "name": "Introspective",
    "description": "No description found.."
  },
  "Qn_AYW1WEGzPQqUe3CA": {
    "name": "Knock Out",
    "description": "Producer and Audio Engineer of 29 years old. Considered to be one of the most important Psychedelic Trance artists in Mexico and with a wide musical trajectory, taking his project known as '' Knock Out '' throughout the Mexican Republic to Europe and Asia. C.E.O. And Label Manager of Maya Shakti Records managing artists around the world and distributing musical content on platforms such as Itunes, Spotify, Beatport, Amazon among others. He currently works for SAE Institute México as Audio Supervisor and has: Pro Tools Instructor 101 & 110 Certification Experience and excellent handling of other DAW's like Logic and Cubase. Music Business Foundations Diploma by Berklee Academy Online. Also collaborating with Dacru Records (Belgium) Gobenix Productions (Switzerland) Universal Life Company (Mexico), UP Records( Australia)"
  },
  "vMQ7RxSQqpxzyBIjusw": {
    "name": "XoXo",
    "description": "No description found.."
  },
  "uYGjZ0P6k3N9QW0OEmo": {
    "name": "Logic Bomb",
    "description": "Logic Bomb are fine purveyors of Psychedelic stereophonic audio. The Swedish maestros of sonic science. Psy Trance multi layered grooves and atmospherics with soul and power. A deep kaleidoscopic journey through rich electronics like only they know how.Jonas and Johann started making music in the mid 90  ́s but it was probably the release if their first album, “Headware” on Spiral Trax in 2000 that got them noticed. Tip World quickly picked up on the act and 2 years later released the album “Unlimited” which was a big success on the Psy Trance scene and catapulted them into premiere players who had their own distinct sound and a very high quality polished production. They also received national radio play with BBC Radio1 and have been supported by many big names including Paul Oakenfold who is set to release a single of theirs later in the year on Perfecto.Check out this classic youtube clip. 63000 listens: http://www.youtube.com/watch?v=x72UVwm6pDYThey went onto be a very busy touring band and toured relentlessly for a number of years before releasing Sonic Algebra with Solstice Music in Japan. Tip were sad to see that album slip them by and again they proved themselves to be a cut above the rest. One of the most loved acts in the genre that appeals to the full on party crowd as well as the cynical, hard to please serious music fans. Only a small handful of acts can do this.After a couple of quiet years, in 2010 we saw the rebirth of Logic Bomb and a return to Tip Records.The new album, The Grid was perhaps the most eagerly awaited album of the genre in 2011. And it doesn ́t disappoint. The new tracks are outstanding and unique. Battleships of shining beauty. They sound like they have technology others lack. A reviewer famed for his cynical tendencies said of the recent Logic Bomb track on last years “White” comp on Tip Records,“Logic Bomb remind me of how I fell in love with this music. Listening to it makes me want to grab my Tip tshirt and run out to the nearest big Psy festival. The world needs more Logic Bomb!”Hear for yourself and see for yourself the reactions of fans: http://soundcloud.com/logicbomb/logic-bomb-sonic- algebra-2011Truly one of the genre leaders, loved by all. They manage to please both fans of the more progressive, minimal styles and the more full on Psy at the same time. Psychedelic, sumptuous audio for the discerning listener.."
  },
  "lioJbD8GgDtoYeyIOL8": {
    "name": "Mystika",
    "description": "Dj Frascky and Dj Lulu’, the duo behind Mystika, know each other since 2004 when they first met at psytrance parties, of course. One day, not long ago, they decided to join forces to start the Mystika project. The final goal is to make any kind of EDM with no boundaries of genres and BPM. Dj Frascky is a very popular dj of the past decade, having played in the major Italians psytrance parties; as soon as he got in touch with psytrance, he started his own music productions. Year after year, he became a top level producer very known across the world as a ghost producer, especially in the techno and house scene. He was also part of the Perceptors project, which already had many psytrance releases on various labels (Y.S.E., Digital Nature etc), before the duo split up few years ago. Dj Lulu’, is one of the pioneer female dj who started playing around Europe since her debut, she left her mark all around the continent and beyond, thanks to her particular attention and sophisticated music selection. She played very often in London (where she lived for several years) and the rest of Europe and world (Italy, Germany, Poland, Switzerland, Denmark, UK, Hungary, Mexico etc.), delighting the dancefloors with both Psytrance/Fullon and Progressive djsets. When you listen to her djset you can \"suddenly realize that time is not linear, but past, present and future exists at the same time. The now equals to eternity and our existence never ends” (SUN Festival Crew). She also released a compilation called Beams of Light in 2013, alongside few tracks with other artists. Expect Sparkling bubbles at every single release, from this eccentric duo!"
  },
  "NV-Cust2xv78MIInFvM": {
    "name": "Neuroplasm",
    "description": "UK producer Krys Neuroplasm (24/7 Records) has developed a highly innovative and futuristic form of psychedelic trance. With a solid reputation across the globe for his explosive and uplifting live sets, the immersive sound of Neuroplasm has electrified dance-floors at many major festivals and venues around the world. Bridging the gap between light and dark, with an experimental but accessible sound, this music captures the true spirit of classic Psytrance, delivered with a cutting-edge, modern style."
  },
  "TvWhnRdxSMmUYcb57Zo": {
    "name": "Escape",
    "description": "Escape is the modern EDM project of experienced south african producer Chris Hoy. His background is in psytrance, where since 2001 he has been known as sHiFt, Pitch Hikers, Twisted System, and Mantis. He runs the record label neXus media from his base in Cape Town. In 2009 he approached JUST MUSIC south africa about doing some commercial remix work. They threw the bone and the rest is history. His style is varied and unique. It contains elements of Dubstep, Electro, Moombahcore, Progressive, Commercial and Breaks. He has remixed artists: LCNVL, Childish Gambino, Bekuh Boom, Z ebra&Giraffe, DeathBYMisadventure, Pascal&Pearce, Flash Republic, Cosmic Xcel, Tetrix Bass, Blitzkrieg and many more, available on iTunes through JUST MUSIC or on Beatport"
  },
  "r5grZvf-IXK-BOxuTac": {
    "name": "Solitary Shell",
    "description": "France has yet another trick up its sleeves with Solitary Shell. The Lyon native started to mix and produce right after a summer of stunning festivals, such as Hadra and Ozora.Like a gigantic storm cell, Solitary Shell’s music holds an unmistakable beauty held together by unimaginable power. Full-on for all times, his tracks hold a melodic sunny side with a certain aggressiveness that makes them suitable for any time of the day, without neglecting at-home listeners. He aims to make you live the transcendent experience that is a psychedelic festival every time he plays his sets. Solitary Shell makes it a point to take you somewhere you have never been with his attention to details. Get ready to feel like you’ve never felt before."
  },
  "NUU-xOqweOfIOhLOujk": {
    "name": "Sungirl",
    "description": "Sungirl is the female power and drive of Panmusic and have been driving masses insane all over the world. Sungirl started to spin vinyl's at the age of 13, in the early days she was playing Techno music and after attending a Psychedelic Trance Party she got immediately hooked. Yana sold all her vinyl's and started to collect Psy Trance music.In 2005 Sungirl received The Best DJ award of the year in the city of Moscow. Strongly motivated by the recognition of her peers she decided to take on the world and started to play overseas. She played in many major festivals in Europe, like the Boom festival and the Full Moon festival in Germany. In 2006 at the invitation of Sirius Records she played her first gig in Japan and literally blew the audience away. Full of youth, charisma and positive energy she seduced the Japanese crowd with her style. She did so well that the promoter immediately signed her up. In the mid of 2007 she compiled her first compilation 'Multitouch' on Sirius Records. She co-produced the second track of this compilation with Freedom Fighters from Israel. All the tracks of her first compilation have been hand picked by Yana and are in her own words powerful and futuristic. Expect many more to come from this young talent."
  },
  "QGAKL8rhAlg6wuhpuIA": {
    "name": "U-Recken",
    "description": "As a dedicated psychedelic artist U-Recken has managed to capture the essence of psychedelic music. Yaniv takes trance to its right place as intelligent music, making use of bass rhythm and melodies as a carrier for the message of light, love and eternal freedom of thought.After two successful studio albums (Aquatic Serenade in 2006 and Deeper Into Man in 2008) he’s ready to move on to the next stage in his career. In 2010 he founded \"Tree Of Life\" and today he’s responsible for one the biggest psytrance festivals, taking place in Turkey. The festival reflects his unique taste of music and concept.Since 2011 Yaniv joined forces with Belgium based label Dacru Records after already releasing tracks as ‘Stop Time’, ‘Days In Space’ and ‘The Optimist’ (vs DigiCult) with this label. Now a third and double full album ‘A Light at the End of the World’ is being prepared for release at Dacru Records. A little prior to... the end of the world! ;-)Stay tuned! A new storm is coming."
  },
  "970rXoHLceb1J5imY_U": {
    "name": "Vibe Tribe",
    "description": "Vibe Tribe is the project of producer Stas Marnyanski.Stas, Russian born Israeli, has been producing electronic based music since his early teens (Age 13), 4 years of experimentation of thorough learning kick started his wonderful, professional career that’s growing and developing in the past 10 years.His innovative and breathtaking melodic high tech psytrance style, has fast gained him global recognition, and placed him on the most demanding stages all over the world.Ever since, this prodigy has been touring the globe constantly performing basically on every important dance floor, presenting his unique powerful style to mass audiences.This busy soul is always at work, producing more and more fresh new material & remixes, which will being released constantly in his own label Mainstage Records."
  },
  "HJFQghXEzJftiyo0Q9s": {
    "name": "Spade",
    "description": "Spade is the Full On production alias of Psy-Trance DJ and producer Elmar Ivatarov.  Originally half of Full On act Vibe Tribe Ivatarov has been producing as Spade since 2008. Many of Spade’s productions have been collaborations with Vibe Tribe."
  },
  "DC2hJ0Ql6x2-HIai9XE": {
    "name": "Faders",
    "description": "\"Faders\" consist of the two talented psytrance producers Or Kopel and Nati Asraf. Both come from Beer-Sheva, south Israel. Or and Nati Found their way into trance scene since they are young, each-one brought his own style to this project and after few years of working they startet to making music together and they created the biggest hit \"Rainbow Serpent\" with Sundose and since that moment they promised their place in the trance scene with hits such as: \"Feelings\" and \"Controllers\" also collaboration and remixes with the finest trance artists as: Melicia, Audiotec, Electro Sun, InterSys, LMS, System Nipel, Indra, Didrapest and many more to come… \"Faders\" producing dancefloor oriented full on music with a lot of emotions and wave breakers with uplifting melodised and smashing grooves and baselines that pumping you higher and higher. Their influences come from: Electro, House, Alternative Rock and Techno."
  },
  "D1phHP_rMTD5b56wQOQ": {
    "name": "Xamanist",
    "description": "Xamanist is Sérgio Ribeiro, a portuguese psytrance producer. Since childhood he has played guitar and synths, so it is no surprise that he became interested in composing electronic music after discovering psytrance at Boom Festival 2000. After maturing his own original style for years he established the Xamanist project, blending the old with the new, balancing darkness with light and melody with rhythm. Mixing goa trance melodies with progressive arrangements, creative ow and storytelling, and a high degree of psychedelism!"
  },
  "kZrDVxNZf0kA1C3Ky4o": {
    "name": "X-Side",
    "description": "X-Side is the musical endeavor of Josè Luis Cruz from Mexico. The intense scene in Mexico City gave him all the inspiration he needed to sharpen his skills and to start creating some maddening tracks. After some time spent experimenting, he finally found a sound that is truly his: energetic, fast paced, relentless, rumbling awesomeness. It’s a spinning, topsy turvy laser show turned into music, yet precise enough to target single neurons at will. Eat a light meal because you’ll be moving plenty to the unrelenting kick and bass with heavy mass. This is r anyone who likes to shake it properly until the end of the night.  X-Side Music allowed him to play across Europe and it caught the interests of legendary producers with whom he got to share views and ideas and work on amazing collaborative tracks. This is a rolling rock that won’t be stopped. It’s only gonna get better."
  },
  "s16ru75q_owOR2qYQlk": {
    "name": "Amplify",
    "description": "AMPLIFY - (Uk/Mex) The mind behind the project Amplify is Andrew Olavarrieta, former part of the well known project Delysid and the more underground Wicked Wires. Andrew is 36 years old half Mexican half British and started to make music and mix since 1998...his musical background comes along with styles like ska, reggae, jazz, latin music and  ethnic rhythms. He has always being very interested in explore the cutting edge sounds and the mind blowing rhythms of trance. Amplify style is Full-On Psytrance, filled up with strong production, emotional leads, amazing melodies and fresh new ideas.  Amplify sound is always developing, getting upgraded and stretching its artistic and technological advances to the max.   Amplify have mashed up dancefloors in the biggest festivals around the globe like Universo Paralello (Brasil), Full Moon Festival (Germany), Odissey & Atmosphere Festival (Mexico), Psybertech Festival (Portugal), Existence Festival (Spain), The Experience Festival (Thailand) and have played in many countries like Cyprus, Austria, Guatemala, Chez Republic, Italy, Israel, England and many more."
  },
  "TCJiSyD1N__5o4mZ3aw": {
    "name": "Zone Tempest",
    "description": "Boz is the face behind 'Zone Tempest', a psy-trance artist from Melbourne / Australia that has been truly inspired. Ready to capture a vision of sound and present a mind altering musical journey through a series of complex pulsating rhythms to unwind the soul. He has been producing his own unique sound, which is a combination of advanced forward thinking futuristic progressive psy-trance with a driving dark groove that creates that perfect atmospheric dance floor vision with releases on Universal Tribe Records, Higher Recordings and Iono-music."
  },
  "-Xc7gB9akfCKWrf9AcI": {
    "name": "Deliriant",
    "description": "Deliriant is the project of Shane Renew, from Cape Town, South Africa. With a love and passion for music since childhood, over a decade of DJ and production experience, 2 full albums, a multitude of single releases, and a career as a studio engineer - he is a well established artist in an ever- changing industry. Signed to Spectral Records (Menog) and Nexus Media (sHift), he has played at top parties all over the country, as well as a number of international festivals in Australia, Europe and more. His music delivers an enchanting, energy packed ride, riddled with dark atmospheres, intense breakdowns, clever drops, driving basslines, powerful leads and an always solid groove. With his top notch production and intelligent arrangement, he has a deep understanding of how to move dancers from the inside. Deliriant is powerful and driving, yet still provides the listener with a taste of clarity, streamlined minimalism, and a melodic feel. This is music from the future - watch thiss pace."
  },
  "K5Z9DY-RwQij9gACw2c": {
    "name": "Timecode",
    "description": "No description found.."
  },
  "XXPuyTT2mggUbHYRKz0": {
    "name": "E-Mov",
    "description": "Kostas Daikos and Vangelis Alexandris are the individuals behind the Greek project E-Mov. Kostas became interested in electronic music production during his student years which he spent mostly in the UK. With the experience he already had from many years of musical studies and as a performing guitar player in various bands he started composing various styles from lounge to drum'n'bass, over ambient to psychedelic. Vangelis, a wel known actor in Greece, spent many years djing in various events in Athens and performing in rock and ethnic bands either as vocalist or percussionist. It was in 2003 when they decided to team up, creating a blend of psychedelic and progressive music, largely influenced by ethnic and tribal elements. Guitars, male and female vocals and percussions were ingeniously incorporated. In 2009 they released their debut album at EQNation Records, leading to a fair amount of gigs all over Greece. In 2013 they are taking another step up the ladder and joined Belgian label Dacru Records. Their second full album 'The Journey of Pan', released in October 2013 is bound to win them some international recognition."
  },
  "c78FejOj08fK1QJfnsU": {
    "name": "ConWerter",
    "description": "Thanasis Zouzoulas born in Athens in 1983 is the mastermind behind the Conwerter project. It was in 2003 when he decided to produce his first psychedelic tunes after finishing his music technology studies and becoming a qualified sound engineer. A year later, Conwerter joined Harmonia Records and started performing his music in various events all around Greece, at the same time he was working as a sound engineer in some of the most famous post production studios in Athens. In 2011 he released his debut album \"Invisible Landscape\" and at the moment he undertakes mastering services for Harmonia Records and various artists while taking short breaks for smashing the dancefloors all around the globe in some of the biggest events."
  },
  "d74MIYg2anLfHb-rgRc": {
    "name": "Orisma",
    "description": "Orisma, is an Greek Dj & Producer, Artist on Yellow Sunshine Explosion recordings. He was born on November 1988 in Thessaloniki, where he still lives. From a very young age he had a great passion for music and when was just 12 he was interested by electronics rhythms. At the age of 15 he had his first experience as a Dj at small events and clubs. Some years later, as a professional Dj, he starts to study \"Music Technology\" and to make his own sound. After experimenting on other kind of music, he returns to his first love, Psy-Trance! In 2013 try to combine Psy-Trance rhythms and grooves with powerful harmonic progressive melodies, as a result an EP called, \"Sonnus - Invictus\". A year later create a good friend a side project called, \"Psyclists\" and release 4 more tracks, powered by Infinity-Tunes records. But the \"recipe\" succeed in 2015, with the \"birth\" of project \"ORISMA\". In 7th August of the same year, the track \"Orisma - Lost Reality\" it is the cause to launch a brilliant cooperation with the huge label \"Yellow Sunshine Explosion Recordings\"! First \"Orisma\" E.P.(Digital Meditation EP) came on 29/04/16 and the 2nd one E.P. (Balance Of The Universe EP) came on 02/01/17. The 3rd one, released on summer of 2018 and called “Alien Light”, then Orisma hits for 1st time the Psy-Trance charts, with the 14 position on best releases. Next coming an EP, omen from the debut album, on December of 2019 “Smile” EP was “Out” with lot of success. A month later, was time for the big bang, the 1st Orisma solo album! On the middle of January 2020, album was ready to release under the name “Travel Beyond”. Things gone much better and this debut album, hits the 1st position on Beatport’s Top100 Releases also on Psyshop’s Top 100 charts!!! This was ahuge success! Some months later, Orisma project create a remix contest competition hosted by YSE, with the track “The Truth” taken from “Travel Beyond” album."
  },
  "qFxBfXx7fMppieS7Za0": {
    "name": "Solar Walker",
    "description": "Eduardo Padilla Salas, the energy behind DJ Litosh & Solar Walker, is from Tampico, Mexico. He started making music as a hobby but soon realized that it was one of the best ways to express himself. He is a pioneer of the electronic scene in his hometown where he has contributed significantly as an event producer and musical collaborator. Solar Walker is an innovative talent who has achieved a unique style. In every event you will find harmony and bliss in a dynamic and powerful set that will keep you dancing until the last beat. It was in 2006 when Solar Walker and his brother (Dj Espectral) founded the musical collective \"WingMakers CREW\". He has shared the stage with top national and international talents. He has had performances all over Mexico and the United States, in festivals and private events. In December 2018, he released his new E.P. \"Future Sapien\" with Zoo Music. He has also made a remix of the famous track \"Optimus Prime\" by Iron Madness. A couple of months later, \"Genesis\" was released, a track in the legendary compilation of \"Trojans II\", and another one in \"Zoo Army\". His 3rd EP debuted with fellow Mexican talent and good friend Isralienn, called \"Aurora Borealis\". He also released 2 EPs with the German label \"Yellow Sunshine Explosion\". Nowadays he’s working on his new EP with YSE and a single with Iono Records. Soon it will be released on all digital platforms. Stay tuned..!!!"
  },
  "DVhjvXPgfM30q0OZgfk": {
    "name": "Sam Alien",
    "description": "No description found.."
  },
  "YN_R9qXvX1GvQjQ_LCk": {
    "name": "Synchromatrix",
    "description": "No description found.."
  },
  "4tcUX7loPqUwI9ahI9E": {
    "name": "cosmicode",
    "description": "No description found.."
  },
  "mSs6iQQIPkkHv0RhOE3": {
    "name": "Iridian",
    "description": "No description found.."
  },
  "ITtJJTGInKHjplt8MaD": {
    "name": "Earthling",
    "description": "No description found.."
  },
  "gXXgbAQBofIl0mh22iA": {
    "name": "Ajja",
    "description": "No description found.."
  },
  "_UQqYlKOGEdWs5S28zx": {
    "name": "Braincell",
    "description": "No description found.."
  },
  "7SIlTzYROVA6DDkmJQw": {
    "name": "Dickster",
    "description": "No description found.."
  },
  "Wt6frCrBcqU13kPoZw7": {
    "name": "Martian Arts",
    "description": "No description found.."
  },
  "MWtbfOPnSRjGiUvGZlV": {
    "name": "Purple Shapes",
    "description": "No description found.."
  },
  "3olzEfqIbhQe4FUXdsn": {
    "name": "Samadhi",
    "description": "No description found.."
  },
  "Ec5mmEhKBIhcB5Ius0O": {
    "name": "SuperModule",
    "description": "No description found.."
  },
  "G1rdJSeBZnOa38kj783": {
    "name": "Tron",
    "description": "No description found.."
  },
  "WFWhhmMiGaM5Uyns6m6": {
    "name": "Akratas",
    "description": "No description found.."
  },
  "MBI-d7dPH83WRI2yJ2D": {
    "name": "Arkadia",
    "description": "No description found.."
  },
  "wdhnH_egZgMPbuI0yf9": {
    "name": "Athzira",
    "description": "No description found.."
  },
  "75-Ag0DfOxXvVNfh9yM": {
    "name": "LunaRave",
    "description": "No description found.."
  },
  "wsfzQ0UfZYu1n9vSV32": {
    "name": "Cambium",
    "description": "No description found.."
  },
  "e9fXECO-a5i04YOby-X": {
    "name": "Spirit Architect",
    "description": "No description found.."
  },
  "QSFJ1PrWWk0wK3KXEvo": {
    "name": "Hinap",
    "description": "No description found.."
  },
  "-qk6bfPqCsVAU1OyltA": {
    "name": "Roja",
    "description": "No description found.."
  },
  "2p9c2wokOHgWNPH-Rmg": {
    "name": "NoFace",
    "description": "No description found.."
  },
  "7_Vy_FIGgcwoImIP4EP": {
    "name": "Nukleall",
    "description": "No description found.."
  },
  "SN4vtt7TB6L5dsId4wc": {
    "name": "Adrenaline Rush",
    "description": "No description found.."
  },
  "Tzx4GnAqT2LyLEmSO4L": {
    "name": "Radikal Moodz",
    "description": "No description found.."
  },
  "LdJn8TcuMUPylIMrndR": {
    "name": "Gandhabba",
    "description": "No description found.."
  },
  "qDxNAkaeG0-JOK-i3BF": {
    "name": "Siloka",
    "description": "No description found.."
  },
  "wTiOw7c6gizmQTPz6_z": {
    "name": "Wubba Lubba",
    "description": "No description found.."
  },
  "UyVErVqu3JgsuCNZxMU": {
    "name": "Stryker",
    "description": "No description found.."
  },
  "z4c34MbfC_UOZ8W52zF": {
    "name": "Hyriderz",
    "description": "No description found.."
  },
  "M-J-UTCEcduR1ldqQxm": {
    "name": "Zeridium",
    "description": "No description found.."
  },
  "ybj0prbyZtRbqgnHq-z": {
    "name": "Render",
    "description": "No description found.."
  },
  "B19JXbGYYZuol8g3RDJ": {
    "name": "Audiofire",
    "description": "No description found.."
  },
  "zyj8k2ALSUNp8sAqdHE": {
    "name": "Overdrive",
    "description": "No description found.."
  },
  "kJYhnPaaI3hdueuhBKB": {
    "name": "Bionix",
    "description": "No description found.."
  },
  "ykPYtk8YH31p0MU6Mob": {
    "name": "D_Maniac",
    "description": "No description found.."
  },
  "8lSBrcKwQZ13JeMhUGE": {
    "name": "Demosys",
    "description": "No description found.."
  },
  "dV8s1PEsOXi9Qflsmfy": {
    "name": "Insignia",
    "description": "No description found.."
  },
  "n6vy-XWLiICNp_JOSfc": {
    "name": "N-Kore",
    "description": "No description found.."
  },
  "gzzWvhmyR8MyrnlJIxs": {
    "name": "Optimize",
    "description": "No description found.."
  },
  "bcVXgnqtI618QKxiuRi": {
    "name": "S.O.5",
    "description": "No description found.."
  },
  "mQIT6JO2Qq2B_-w3UKN": {
    "name": "Anthill",
    "description": "No description found.."
  },
  "YvzzqAwqRJFe3rRItGX": {
    "name": "Kabayun",
    "description": "No description found.."
  },
  "JO5s-fGaUf9b48gDnNY": {
    "name": "Antonymous",
    "description": "No description found.."
  },
  "2rT8lRbo9LGiFfuO3Ua": {
    "name": "Cosinus",
    "description": "No description found.."
  },
  "aFf2STe9KcKah3o_ZyI": {
    "name": "Delytic",
    "description": "No description found.."
  },
  "TnnTXJdaALsz_bwgwyF": {
    "name": "Farebi Jalebi",
    "description": "No description found.."
  },
  "dsXqg6A9ehoF7v4q6Je": {
    "name": "Ingrained Instincts",
    "description": "No description found.."
  },
  "5MbE3ROQiBpJmadQiv8": {
    "name": "Ninesense",
    "description": "No description found.."
  },
  "cr3kZHk_GN4GRNuvKWY": {
    "name": "Virtual Light",
    "description": "No description found.."
  },
  "cv3XwPepAID8ckhzcxy": {
    "name": "Vertical",
    "description": "No description found.."
  },
  "5KrZHOqfFus9fu0JLwn": {
    "name": "Witchcraft",
    "description": "No description found.."
  },
  "43H-uRVzYsAT2SYnNjK": {
    "name": "Yab Yum",
    "description": "No description found.."
  },
  "SGHcV1l0g01anOZ46MQ": {
    "name": "Junju",
    "description": "No description found.."
  },
  "X0mQFlT6sdTGRNRCE6x": {
    "name": "Ovnimoon",
    "description": "No description found.."
  },
  "6hRKEhBhH9F__U7iRsp": {
    "name": "Killerwatts",
    "description": "No description found.."
  }
}