{
  "0": {
    "name": "Lil Nas X - Montero Lamar Hill",
    "description": "Lil Nas X was born as Montero Lamar Hill in 1999. His stage name combines \"Lil\" (a common naming trope for rappers), \"Nas\" from a Twitter account he ran while a devoted fan of Nicki Minaj and \"X\" as the Roman numeral 10 (the number of years he thought it would take to find fame). Nas has the social media savvy to make his work stand out in a crowded landscape, which helped with his breakthrough \"Old Town Road.\" Nas then created a meaningful, yet still attention-grabbing, first album: Montero (2021). The record contains hits like \"Industry Baby\" and \"Montero (Call Me by Your Name)\"; the personal tune \"Sun Goes Down\" addresses how a young Nas grappled with being gay. After being taught homosexuality was wrong when he was growing up, Nas conveys the message that he would like gay relationships to become so accepted by society that they are rendered unremarkable."
  },
  "1": {
    "name": "Altered State",
    "description": "Altered State (David Sheehan) is a well apprised Dublin based Dj and producer. He is highly considered at the forefront of the Irish Psy trance scene, this being purely based on his ample talents as both an entertainer and a producer.Altered State is the ultimate entrenpreneur and the epitome of potential. His genuine dexterity will shed nothing only stardom upon his journey through the great and almighty dance scene of today & is certainly a Dj not to be missed."
  },
  "2": {
    "name": "Xenoben",
    "description": "Xenoben is the stage name of UK-based Psychedelic Trance producer & DJ Benjamin Gildersleve.Ben’s passion for Psychedelic Trance started in London at the turn of the century when he attended some of the UK’s biggest Psytrance events. He turned from DJing to producing in 2012 and since then has released several tracks on CD and digital format and performed at various festivals.In May 2018, Xenoben released his first EP ‘Morning Daze’ on major label TesseracTstudio which smashed its way to the top of the Beatport Psytrance Releases chart. Later that year, a collaboration EP with Waveform also hit the number 1 position, earning Ben and his project more respect within the trance scene.Inspiration for his project is drawn from other talented UK producers and merged with the Serbian-style techniques of TesseracTstudio artists to produce clever and hypnotic polychrome atmospheres and trippy psychedelic vocal effects over intimidating heavy basslines.The future is bright for Xenoben with many singles, releases, collaborations and event bookings coming in the very near future."
  },
  "3": {
    "name": "Infected Mushroom",
    "description": "Electronic music, mega-revolutionaries Infected Mushroom are renowned for being the sonic innovators of crafting hypnotic arrangements, complex layered melodies and synthetic rhythms known as “Psy Trance. The duo broke into the scene with the release of their first album in 1999, and unconsciously changed trance music forever.Responsible for the evolution of psychedelic trance, they have gone on to experience the highest level of success in the psy trance scene, crossing over towards the electronic dance community, selling out venues and headlining festivals worldwide."
  },
  "4": {
    "name": "Mobb Deep",
    "description": "Mobb Deep stood tall as East Coast hardcore rap figureheads on the basis of their epochal album The Infamous. Released in April 1995, The Infamous was released almost exactly a year after Illmatic and about half-a-year after Ready to Die -- the debut masterpieces of Nas and the Notorious B.I.G., respectively, and likewise albums of momentous significance for East Coast hardcore rap. On The Infamous, the duo of Prodigy and Havoc set the tone for future generations of hardcore New York rappers, from crews such as G-Unit and Dipset, to the likes of Ka and Roc Marciano. Subsequent Mobb Deep releases were equally influential, especially Hell on Earth (1996). The following decade, Prodigy and Havoc recorded for G-Unit -- the label of Mobb Deep disciple 50 Cent -- as well as numerous other outlets. The duo's partnership faltered for a time, but they were actively performing into mid-2017, when Prodigy died from complications of an illness that had afflicted him since infancy."
  },
  "5": {
    "name": "Atacama",
    "description": "Since their very first psytrance parties more than ten yearsback in time the Berliners Kevin Hentschel and RafaelGomez never stopped experimenting with electronic sounds.Alongside multiple excursions into various sub-genres, ownlabel activities and many open air- and club events the twofriends concentrate since 2012 on the production of drivingpsychedelic trance music. After some releases in Spain andfurther mindblowing experiences while playing large festivals– such as the Fusion Festival – the two musicians reinventedtheir sound – and themselves – as „Atacama“.Sometimes mysterious, always complex and preferencialdriving Atacama carry off their listeners in spheres betweenbygone experiences and oncoming promises where mythsand reality, rhythm and movement merge into a cosmic unity."
  },
  "6": {
    "name": "Jakaan",
    "description": "Jakaan (24) is one of the most productive DJ's in the Dutch psytrance-scene. Since the age of 13 he has been spinning psytrance, full on and progressive. You can follow him on his youtube-channel where he uploads a new mix every week, including the latest releases. He is always looking for the latest tracks, when he's playing a live-set he often spins unreleased records from the most talented and well known producers in the psytrance-scene. Nowadays you can frequently hear Jakaan DJ-ing on psychedelik.com Jakaan often perfoms his tricks at squat-parties, but also in larger venues and festivals such as \"Club Lite\", \"Magneet Festival\" (NL) and \"The -S-Xperience\". When he's playing live, Jakaan never plays the same set twice. Jakaan knows and feels what the crowd wants and needs and he won't hesitate to give the people what they came for... A good vibe on the dancefloor!"
  },
  "7": {
    "name": "Reborn",
    "description": "Reborn is a project by Faraz Radmehr from Tehran-Iran. Born in 1988 and The journey into Psytrance and Electronic music has begun in India in 2012. After he had attended many Psytrance and Electronic music parties and festivals mainly held in Goa-India for almost 11 years while living there, he decided to make his own music by producing and experimenting various genre of music. The result of years of self-tought production is something very unique and rare in music market which have brought the attention to him so quickly. Presently he creates his own unique style of electronic music which includes touches of Psytrance, Progressive Trance and Full On. Currently his main focus of him is on Psytrance style of electronic music. Stay tuned for upcoming releases."
  },
  "8": {
    "name": "J Dilla",
    "description": "Born and raised on the east side of Detroit, Dilla -- James Yancey -- was forced by his parents to become involved with music, and he was a record fanatic at a young age, absorbing funk and rap singles and jazz albums, from Slave to Jack McDuff. He learned to play cello, keyboards, trumpet, and violin, but drums got him like nothing else. He tried his hand at producing tracks on a tape deck by using the pause and record buttons, and he also took up MC'ing. In 1988, he formed Slum Village with Pershing High School friends Baatin and T3. It wasn't until 1992, after receiving some valuable guidance from fellow Detroiter Amp Fiddler, that his talent really began to take shape."
  },
  "9": {
    "name": "Astrix",
    "description": "Astrix has been one of the leading trance producers and DJs in the world for more than 15 years, carrying his musical message of psychedelic emotional uplifting trance to every corner of the world, to the biggest urban clubs and far away beaches, huge festivals and underground events. Devoted to his art and a true perfectionist, Astrix is known for his massive hypnotic explosive sets on the dance-floor and for his precise detailed production in the studio. Both always laced with tons of feel and musicality. His music has been topping the charts and his albums are considered milestones."
  },
  "10": {
    "name": "Transient Disorder",
    "description": "Filipe Trindade a.k.a Transient Disorder was born in Portugal in the 90’s. His interest for music started very early, at the age of 13 he took his first steps playing the guitar. Later he had his first contact with electronic music, and caught the bug, never looking back. In the past he was part of several metal, hardcore and punk bands, and also participated in various electronic music projects, until he formed his solo project Transient Disorder, focusing on the psychedelic. His appearance on the Dacru Records uncharted series didn’t go unnoticed as the label offered him a fixed spot on their roster. As a young producer, his style is a perfect fit for dacru, with beautiful melodic touches and a strong production. Keep an eye out for this up-and-comer with many releases in the pipeline at Dacru Records."
  }
}