{
  "0": {
    "name": "Lil Nas X - Montero Lamar Hill",
    "description": "Lil Nas X was born as Montero Lamar Hill in 1999. His stage name combines \"Lil\" (a common naming trope for rappers), \"Nas\" from a Twitter account he ran while a devoted fan of Nicki Minaj and \"X\" as the Roman numeral 10 (the number of years he thought it would take to find fame). Nas has the social media savvy to make his work stand out in a crowded landscape, which helped with his breakthrough \"Old Town Road.\" Nas then created a meaningful, yet still attention-grabbing, first album: Montero (2021). The record contains hits like \"Industry Baby\" and \"Montero (Call Me by Your Name)\"; the personal tune \"Sun Goes Down\" addresses how a young Nas grappled with being gay. After being taught homosexuality was wrong when he was growing up, Nas conveys the message that he would like gay relationships to become so accepted by society that they are rendered unremarkable."
  },
  "1": {
    "name": "Altered State",
    "description": "Altered State (David Sheehan) is a well apprised Dublin based Dj and producer. He is highly considered at the forefront of the Irish Psy trance scene, this being purely based on his ample talents as both an entertainer and a producer.Altered State is the ultimate entrenpreneur and the epitome of potential. His genuine dexterity will shed nothing only stardom upon his journey through the great and almighty dance scene of today & is certainly a Dj not to be missed."
  },
  "2": {
    "name": "Xenoben",
    "description": "Xenoben is the stage name of UK-based Psychedelic Trance producer & DJ Benjamin Gildersleve.Ben’s passion for Psychedelic Trance started in London at the turn of the century when he attended some of the UK’s biggest Psytrance events. He turned from DJing to producing in 2012 and since then has released several tracks on CD and digital format and performed at various festivals.In May 2018, Xenoben released his first EP ‘Morning Daze’ on major label TesseracTstudio which smashed its way to the top of the Beatport Psytrance Releases chart. Later that year, a collaboration EP with Waveform also hit the number 1 position, earning Ben and his project more respect within the trance scene.Inspiration for his project is drawn from other talented UK producers and merged with the Serbian-style techniques of TesseracTstudio artists to produce clever and hypnotic polychrome atmospheres and trippy psychedelic vocal effects over intimidating heavy basslines.The future is bright for Xenoben with many singles, releases, collaborations and event bookings coming in the very near future."
  },
  "3": {
    "name": "Infected Mushroom",
    "description": "Electronic music, mega-revolutionaries Infected Mushroom are renowned for being the sonic innovators of crafting hypnotic arrangements, complex layered melodies and synthetic rhythms known as “Psy Trance. The duo broke into the scene with the release of their first album in 1999, and unconsciously changed trance music forever.Responsible for the evolution of psychedelic trance, they have gone on to experience the highest level of success in the psy trance scene, crossing over towards the electronic dance community, selling out venues and headlining festivals worldwide."
  },
  "4": {
    "name": "Mobb Deep",
    "description": "Mobb Deep stood tall as East Coast hardcore rap figureheads on the basis of their epochal album The Infamous. Released in April 1995, The Infamous was released almost exactly a year after Illmatic and about half-a-year after Ready to Die -- the debut masterpieces of Nas and the Notorious B.I.G., respectively, and likewise albums of momentous significance for East Coast hardcore rap. On The Infamous, the duo of Prodigy and Havoc set the tone for future generations of hardcore New York rappers, from crews such as G-Unit and Dipset, to the likes of Ka and Roc Marciano. Subsequent Mobb Deep releases were equally influential, especially Hell on Earth (1996). The following decade, Prodigy and Havoc recorded for G-Unit -- the label of Mobb Deep disciple 50 Cent -- as well as numerous other outlets. The duo's partnership faltered for a time, but they were actively performing into mid-2017, when Prodigy died from complications of an illness that had afflicted him since infancy."
  }
}